

package com.melo.wechat.constant;

/**
 * @Description: 状态码枚举类
 * @author: Jun
 * @date: 11:46 2021/5/25
 */
public enum Status {

    /*
     **************************************************************
     *              通用状态
     **************************************************************
     */
    /**
    操作成功
     */
    SUCCESS("操作成功"),
    /**
     * 操作失败
     */
    FAILED("操作失败"),
    /**
     * 未设置
     */
    UNSET("未设置"),

    /*
     **************************************************************
     *              注册状态
     **************************************************************
     */

    /**
     * 该邮箱已被注册,请更换邮箱
     */
    IS_EXIST_EMAIL("该邮箱已被注册,请更换邮箱"),
    /**
     * 注册成功
     */
    SUCCEED_REGISTER("注册成功"),

    /*
     **************************************************************
     *              登陆状态
     **************************************************************
     */

    /**
     * 密码错误
     */
    WRONG_PASS("密码错误"),
    /**
     *该用户名不存在
     */
     WRONG_USERNAME("该用户名不存在"),
    /**
     * 验证码错误
      */
    WRONG_CHECKCODE("验证码错误"),
    /**
     * 登录成功
     */
    SUCCEED_LOGIN("登录成功"),
    /**
     * 欢迎体验微信
     */
    WELCOME_VISITOR("欢迎体验微信"),
    /**
     * 系统繁忙,请稍微重试
     */
    SYSTEM_ERROR("系统繁忙,请稍微重试"),
    /**
     * 登录失败
     */
    FAILED_LOGIN("登录失败"),
    /**
     * 你已被封号
     */
    IS_BLOCKED_USER("你已被封号"),
    /**
     * 游客邮箱
     */
    VISITOR_EMAIL("visitor@qq.com"),
    /*
     **************************************************************
     *              修改个人用户信息状态
     **************************************************************
     */

    /**
     * 原密码有误
     */
    WRONG_OLD_PASS("原密码有误"),

    /*
     **************************************************************
     *              搜索状态
     **************************************************************
     */
    /**
     * 找不到该用户
     */
    NO_USER("找不到该用户"),
    /**
     * 找不到该群聊
     */
    NO_GROUP("找不到该群聊"),
    /**
     * 你已添加该用户
     */
    HAD_ADD_USER("你已添加该用户"),
    /**
     * 你已在此群聊中
     */
    HAD_AT_GROUP("你已在此群聊中"),
    /**
     * 你已发送过群聊申请,请等待群主同意
     */
    HAS_SEND_GROUP("你已发送过群聊申请,请等待群主同意"),

    /*
     **************************************************************
     *              好友状态
     **************************************************************
     */
    /**
     * 添加成功,请等待对方同意
     */
    WAIT_AGREE("添加成功,请等待对方同意"),
    /**
     * 你已发送过好友申请,请等待对方同意
     */
    HAS_SEND_FRIEND("你已发送过好友申请,请等待对方同意"),
    /**
     * 添加成功,你们已成为好友,快打个招呼吧
     */
    SUCCEED_ADD("添加成功,你们已成为好友,快打个招呼吧"),
    /**
     * 拒绝了你的好友请求
     */
    REFUSE_ADD_FRIEND("拒绝了你的好友请求"),
    /**
     * 拉黑成功
     */
    SUCCEED_BLOCK("拉黑成功"),
    /**
     * 取消拉黑成功
     */
    SUCCEED_UNBLOCK("取消拉黑成功"),
    /**
     * 你已被拉黑
     */
    IS_BLOCKED("你已被拉黑"),
    /**
     * 在线
     */
    ONLINE("在线"),
    /**
     * 离线
     */
    OFFLINE("离线"),
    /*
     **************************************************************
     *              群聊状态
     **************************************************************
     */
    /**
     * 你已被禁言
     */
    IS_BLOCKED_GROUP("你已被禁言"),
    /**
     * 你未选中待邀请成员
     */
    NO_SELECTED_MEMBER("你未选中待邀请成员"),


    /*
     **************************************************************
     *              WebSocket状态
     **************************************************************
     */
    ALREADY_ONLINE("您已经在一个新的浏览器上登陆，系统将自动断开与本页面的连接，页面将不可用");





    private String message;

    Status (String message){
        this.setMessage(message);
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }
}